erp3l/src/Catalogs/СоответствияСчетовМеждународногоУчета/СоответствияСчетовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствияСчетовМеждународногоУчета</name>
  <attributes>
    <name>СчетРеглУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетМеждународногоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПереходНаНовыеФормулыВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕстьОшибкиПереходаНаНовыйФорматФормул</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияСубконто</name>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьИзИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УказанноеЗначение</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеИсторияПереходаНаНовыеФормулы</name>
      <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.ПрофессииРабочих</types>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.ШтатноеРасписание</types>
    <types>CatalogRef.Партнеры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.ЦеновыеГруппы</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.ДоговорыАренды</types>
    <types>CatalogRef.РодственникиФизическихЛиц</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>CatalogRef.ДоговорыЭквайринга</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Резервы</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

erp3l/src/Catalogs/СоответствияСчетовМеждународногоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает схему компоновки данных для настройки соответствия счетов
//
// Параметры:
// 	СчетРеглУчета - ПланСчетовСсылка.Хозрасчетный - Счет регл. учета.
//
// Возвращаемое значение:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема, применяемая для настройки соответствия счетов.
//
Функция СхемыКомпоновкиДанных(СчетРеглУчета) Экспорт
	
	СхемаКомпоновкиДанных = Справочники.СоответствияСчетовМеждународногоУчета.ПолучитьМакет("СхемаКомпоновкиДанных");
	ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	
	ВидыСубконто = ФинансоваяОтчетностьПовтИсп.ВидыСубконтоСчета(СчетРеглУчета);
	Для НомерСубконто = 1 По 3 Цикл
		ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Субконто%1", НомерСубконто);
		Поле = ПоляНабора.Найти(ПутьКДанным);
		СтрокаВидСубконто = ВидыСубконто.Найти(НомерСубконто, "НомерСубконто");
		Если СтрокаВидСубконто <> Неопределено Тогда
			Поле.Заголовок = Строка(СтрокаВидСубконто.ВидСубконто);
			Поле.ТипЗначения = СтрокаВидСубконто.ТипЗначения;
		Иначе
			Поле.ОграничениеИспользования.Условие = Истина;
			Поле.ОграничениеИспользованияРеквизитов.Условие = Истина;
			Поле.ОграничениеИспользования.Поле = Истина;
			Поле.ОграничениеИспользованияРеквизитов.Поле = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.СоответствияСчетовМеждународногоУчета.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.6.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1de52a4d-f37c-4098-9664-66a3a13a2058");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.СоответствияСчетовМеждународногоУчета.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Конвертирует выражения заполнения субконто в новый формат.
	|Заполняет реквизит ПланСчетов';
	|en = 'Converts extra dimension population expressions to a new format.
	|Populates the ПланСчетов attribute'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ВидыКонтактнойИнформации.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ПланыСчетовМеждународногоУчета.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.СоответствияСчетовМеждународногоУчета.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.СоответствияСчетовМеждународногоУчета.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.СоответствияСчетовМеждународногоУчета.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "МультиязычностьСервер.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "ОбновлениеИнформационнойБазыУТ.ОбработатьВидыКонтактнойИнформацииУТ";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.ВидыКонтактнойИнформации.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.ВидыНоменклатуры.ОбработатьДополнительныеРеквизитыНоменклатурыДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "Любой";

КонецПроцедуры

#Область Обработчики_2_5_5

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Справочник.СоответствияСчетовМеждународногоУчета";
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствияСчетовМеждународногоУчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоответствияСчетовМеждународногоУчета КАК СоответствияСчетовМеждународногоУчета
	|ГДЕ
	|	НЕ СоответствияСчетовМеждународногоУчета.УдалитьПереходНаНовыеФормулыВыполнен
	|	ИЛИ СоответствияСчетовМеждународногоУчета.ПланСчетов = ЗНАЧЕНИЕ(Справочник.ПланыСчетовМеждународногоУчета.ПустаяСсылка)";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.СоответствияСчетовМеждународногоУчета";
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	ПланСчетовПоУмолчанию = Справочники.ПланыСчетовМеждународногоУчета.ПланСчетовПоУмолчанию();
	
	Для Каждого ЭлементСправочника Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлементСправочника.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = ЭлементСправочника.Ссылка.ПолучитьОбъект();
			
			Если СправочникОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ЭлементСправочника.Ссылка);
			Иначе
				
				ОбъектИзменен = Ложь;
			
				ОбработатьИзменениеВыраженийЗаполненияСубконто(СправочникОбъект, ОбъектИзменен);
				
				Если Не ЗначениеЗаполнено(СправочникОбъект.ПланСчетов) Тогда
					СправочникОбъект.ПланСчетов = ПланСчетовПоУмолчанию;
				КонецЕсли;
				
				Если СправочникОбъект.Модифицированность() Или ОбъектИзменен Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ЭлементСправочника.Ссылка);
				КонецЕсли;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ЭлементСправочника.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры


// Выполняет обработку изменений выражений заполнения аналитик (перевод формул на новый формат).
// 
// Параметры:
// 	СправочникОбъект - СправочникОбъект.СоответствияСчетовМеждународногоУчета - Обрабатываемый объект.
// 	ОбъектИзменен - Булево - Флаг изменения объекта.
//
Процедура ОбработатьИзменениеВыраженийЗаполненияСубконто(СправочникОбъект, ОбъектИзменен)
	
	Если НЕ СправочникОбъект.УдалитьПереходНаНовыеФормулыВыполнен Тогда
		ВыраженияДляОбработки = Новый Соответствие;
		ИсходныеВыражения = Новый Массив;
		Для Каждого СтрокаТЧ Из СправочникОбъект.НастройкиЗаполненияСубконто Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Выражение)
				И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы) Тогда
				ИндексСтроки = СправочникОбъект.НастройкиЗаполненияСубконто.Индекс(СтрокаТЧ);
				ВыраженияДляОбработки.Вставить(ИндексСтроки, СтрокаТЧ.Выражение);
				Если ИсходныеВыражения.Найти(СтрокаТЧ.Выражение) = Неопределено Тогда
					ИсходныеВыражения.Добавить(СтрокаТЧ.Выражение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ВыраженияДляОбработки.Количество() = 0 Тогда
			
			СхемаПолученияДанных = СхемыКомпоновкиДанных(СправочникОбъект.СчетРеглУчета);
			
			
			РезультатПреобразований = РаботаСФормулами.ПреобразоватьВФорматИдентификаторовОперандыФормулыСКД(ИсходныеВыражения,
				СхемаПолученияДанных);
				
			Если РезультатПреобразований.ЕстьОшибки Тогда
				ТекстОшибок = "";
				Для Каждого КлючИЗначение Из РезультатПреобразований.СообщенияОшибокПреобразования Цикл
					ТекстОшибок = ТекстОшибок + ?(ТекстОшибок = "", "", " / " + Символы.ПС) + КлючИЗначение.Значение;
				КонецЦикла;
				СправочникОбъект.УдалитьЕстьОшибкиПереходаНаНовыйФорматФормул = Истина;
				ИмяСобытияОшибкиЖР = НСтр("ru = 'Перевод формул и выражение в новый формат';
											|en = 'Conversion of formulas and expression to a new format'");
				ЗаписьЖурналаРегистрации(ИмяСобытияОшибкиЖР,
					УровеньЖурналаРегистрации.Ошибка,
					СправочникОбъект.Метаданные(),
					СправочникОбъект.Ссылка,
					ТекстОшибок);
				// Переход на новый формат формул не гарантируется, т.к. выражения могут содержать ошибки.
				// Отказа от транзакции не происходит.
			КонецЕсли;
			
			ПреобразованныеВыражения = РезультатПреобразований.ПреобразованныеВыражения;
			Для каждого ИндексСтрокиИВыражение Из ВыраженияДляОбработки Цикл
				ИндексСтроки = ИндексСтрокиИВыражение.Ключ;
				СтрокаТЧ = СправочникОбъект.НастройкиЗаполненияСубконто[ИндексСтроки];
				
				ИсходноеВыражение = ИндексСтрокиИВыражение.Значение;
				ВыражениеЗамены = ПреобразованныеВыражения.Получить(ИсходноеВыражение);
				Если ЗначениеЗаполнено(ВыражениеЗамены) Тогда
					СтрокаТЧ.Выражение = ВыражениеЗамены;
				КонецЕсли;
				СтрокаТЧ.ВыражениеИсторияПереходаНаНовыеФормулы = ИсходноеВыражение;
			КонецЦикла;
			
		КонецЕсли;
		
		СправочникОбъект.УдалитьПереходНаНовыеФормулыВыполнен = Истина;
		ОбъектИзменен = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецЕсли
